cases/eye-fsi-tc0/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


28
(
    needle_inlet_left
    {
        type            patch;
        nFaces          1;
        startFace       6272;
    }

    needle_inlet_right
    {
        type            patch;
        nFaces          1;
        startFace       6273;
    }

    needle_outlet_left
    {
        type            patch;
        nFaces          1;
        startFace       6274;
    }

    needle_outlet_right
    {
        type            patch;
        nFaces          1;
        startFace       6275;
    }

    sclera_left_lower
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          7;
        startFace       6276;
    }

    sclera_left_upper
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          29;
        startFace       6283;
    }

    sclera_right
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          7;
        startFace       6312;
    }

    sclera_right_upper
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          29;
        startFace       6319;
    }

    sclera_top
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          80;
        startFace       6348;
    }

    cornea_fsi
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          80;
        startFace       6428;
    }

    lens_bottom
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          30;
        startFace       6508;
    }

    lens_bottom_left
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          30;
        startFace       6538;
    }

    lens_right
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          10;
        startFace       6568;
    }

    lens_left
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          10;
        startFace       6578;
    }

    lens_top
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          30;
        startFace       6588;
    }

    lens_top_left
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          30;
        startFace       6618;
    }

    iris_bottom
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          60;
        startFace       6648;
    }

    iris_pupil
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          5;
        startFace       6708;
    }

    iris_pupil_left
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          5;
        startFace       6713;
    }

    iris_top
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          40;
        startFace       6718;
    }

    tm_limbus_wall
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          4;
        startFace       6758;
    }

    ac_inlet
    {
        type            patch;
        nFaces          5;
        startFace       6762;
    }

    ac_inlet_left
    {
        type            patch;
        nFaces          5;
        startFace       6767;
    }

    outlet_tm
    {
        type            patch;
        nFaces          4;
        startFace       6772;
    }

    outlet_tm_left
    {
        type            patch;
        nFaces          4;
        startFace       6776;
    }

    front
    {
        type            empty;
        inGroups        1 ( empty );
        nFaces          3268;
        startFace       6780;
    }

    back
    {
        type            empty;
        inGroups        1 ( empty );
        nFaces          3268;
        startFace       10048;
    }

    defaultFaces
    {
        type            wall;
        inGroups        1 ( empty );
        nFaces          20;
        startFace       13316;
    }

)


// ************************************************************************* //
