cases/eye-fsi-tc0/fluid/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Laminar — matches Fluent report (Viscous: Laminar).
// Re_eye ~ U*L/nu ~ 1e-4 * 12e-3 / 6.97e-7 ~ 1.7  (deeply laminar)

simulationType  laminar;
