cases/eye-fsi-tc0/fluid/system/changeDictionaryDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}

// Promote blockMesh defaultFaces (orphan quads) to wall — avoids illegal empty patch with faces.

boundary
{
    defaultFaces
    {
        type            wall;
    }
}
