cases/eye-fsi-tc0/fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

// preCICE adapter — FLUID participant (pimpleFoam).
//
// FSI: fluid pressure → force on all interior fluid–solid walls (except lens equator).
// lens_right / lens_left: Robin zonule on solid — fluid lens_right still noSlip but not in preCICE.

participant   Fluid;

preciceConfig "../precice-config.xml";

modules ( FSI );

interfaces
{
    Interface1
    {
        mesh          Fluid-Mesh;
        patches       (
            lens_bottom lens_bottom_left lens_top lens_top_left
            iris_bottom iris_pupil iris_pupil_left iris_top
            sclera_right sclera_right_upper sclera_left_lower sclera_left_upper sclera_top
            cornea_fsi tm_limbus_wall
        );
        locations     faceCenters;
        writeData     ( Force );
        readData      ();
    }
}

FSI
{
    solverType  incompressible;
    rho         rho [1 -3 0 0 0 0 0] 993;
}
